###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  rt        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from everywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_http_ssh_bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-08decc1a4b90eb685"
    }

  # aws_security_group.privatesg will be created
  + resource "aws_security_group" "privatesg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "SSH from everywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_http_ssh_private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-08decc1a4b90eb685"
    }

  # aws_security_group.publicsg will be created
  + resource "aws_security_group" "publicsg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from everywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from everywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_http_ssh_public"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-08decc1a4b90eb685"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ private_ips       = [
      - "10.1.5.100",
      - "10.1.6.69",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_ip_ansible = [
      - "54.166.202.10",
      - "3.81.64.203",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_ip_bastion = [
      - "52.23.207.204",
      + (known after apply),
    ]
  ~ public_ips        = [
      - "54.236.61.52",
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.ansibleinstance[0] has been deleted%0A  - resource "aws_instance" "ansibleinstance" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:instance/i-0a3391bb8262cf5a4" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1c" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0a3391bb8262cf5a4" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-074e067493b2c5f71" -> null%0A      - private_dns                          = "ip-10-1-3-98.ec2.internal" -> null%0A      - private_ip                           = "10.1.3.98" -> null%0A      - public_ip                            = "54.166.202.10" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-020bb710133f45b94",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-02532d18e9b0f48dc" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-public-ansible-3"%0A          - "Owner" = "Group6Ansible"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-public-ansible-3"%0A          - "Owner" = "Group6Ansible"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-020bb710133f45b94",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:816915057134:key/70158fe5-d6f2-43c9-acef-b386b81ebd6d" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-080facbae470a9e61" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.ansibleinstance[1] has been deleted%0A  - resource "aws_instance" "ansibleinstance" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:instance/i-086ed4c36253a34f6" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1d" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-086ed4c36253a34f6" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-07adc6455da624651" -> null%0A      - private_dns                          = "ip-10-1-4-248.ec2.internal" -> null%0A      - private_ip                           = "10.1.4.248" -> null%0A      - public_ip                            = "3.81.64.203" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-020bb710133f45b94",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-087cb0ddccfab17ba" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-public-ansible-4"%0A          - "Owner" = "Group6Ansible"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-public-ansible-4"%0A          - "Owner" = "Group6Ansible"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-020bb710133f45b94",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:816915057134:key/70158fe5-d6f2-43c9-acef-b386b81ebd6d" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0ca063281fc3e88bf" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.bastion[0] has been deleted%0A  - resource "aws_instance" "bastion" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:instance/i-0ec75499964320ea8" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1b" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0ec75499964320ea8" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-087772c63e1795511" -> null%0A      - private_dns                          = "ip-10-1-2-211.ec2.internal" -> null%0A      - private_ip                           = "10.1.2.211" -> null%0A      - public_ip                            = "52.23.207.204" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0b5e8668ce4f20146",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-046cf7fde39153aa4" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-public-bastion-2"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-public-bastion-2"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "30d31834dab0ad9d47aef7d7dd99e547c4879b41" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0b5e8668ce4f20146",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:816915057134:key/70158fe5-d6f2-43c9-acef-b386b81ebd6d" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0aed51e0e3c21b625" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[0] has been deleted%0A  - resource "aws_instance" "privateinstance" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:instance/i-00c8b5fee5218e6fa" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-00c8b5fee5218e6fa" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-0ffdc72c49f29cec3" -> null%0A      - private_dns                          = "ip-10-1-5-100.ec2.internal" -> null%0A      - private_ip                           = "10.1.5.100" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0f952f5463fd28d34",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0e041b06f241a8193" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-private-1"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-private-1"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0f952f5463fd28d34",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:816915057134:key/70158fe5-d6f2-43c9-acef-b386b81ebd6d" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0ed5303db9277ecf8" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[1] has been deleted%0A  - resource "aws_instance" "privateinstance" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:instance/i-04c0be0d29c5900a6" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1b" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-04c0be0d29c5900a6" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-06b0a867f13caae95" -> null%0A      - private_dns                          = "ip-10-1-6-69.ec2.internal" -> null%0A      - private_ip                           = "10.1.6.69" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0f952f5463fd28d34",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0b9f0e11e5c3bb38d" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-private-2"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-private-2"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0f952f5463fd28d34",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:816915057134:key/70158fe5-d6f2-43c9-acef-b386b81ebd6d" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0a193fc45a34836c6" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.publicinstance[0] has been deleted%0A  - resource "aws_instance" "publicinstance" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:instance/i-07edef45ad7d85aff" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-07edef45ad7d85aff" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-00da4da0a0120d2a4" -> null%0A      - private_dns                          = "ip-10-1-1-23.ec2.internal" -> null%0A      - private_ip                           = "10.1.1.23" -> null%0A      - public_ip                            = "54.236.61.52" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-020bb710133f45b94",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-09f86c479fa6fd1b9" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-pulbic-1"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "Group6-prod-pulbic-1"%0A          - "Owner" = "Group6"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "30d31834dab0ad9d47aef7d7dd99e547c4879b41" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-020bb710133f45b94",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:816915057134:key/70158fe5-d6f2-43c9-acef-b386b81ebd6d" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0f5d3123d5976f43a" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_security_group.bastionsg has been deleted%0A  - resource "aws_security_group" "bastionsg" {%0A      - arn                    = "arn:aws:ec2:us-east-1:816915057134:security-group/sg-0b5e8668ce4f20146" -> null%0A      - description            = "Allow HTTP and SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0b5e8668ce4f20146" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "HTTP from everywhere"%0A              - from_port        = 80%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 80%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "SSH from everywhere"%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_http_ssh_bastion" -> null%0A      - owner_id               = "816915057134" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags_all               = {} -> null%0A      - vpc_id                 = "vpc-08decc1a4b90eb685" -> null%0A    }%0A%0A  # aws_security_group.privatesg has been deleted%0A  - resource "aws_security_group" "privatesg" {%0A      - arn                    = "arn:aws:ec2:us-east-1:816915057134:security-group/sg-0f952f5463fd28d34" -> null%0A      - description            = "Allow HTTP and SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-0f952f5463fd28d34" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - description      = "SSH from everywhere"%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = [%0A                  - "sg-0b5e8668ce4f20146",%0A                ]%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_http_ssh_private" -> null%0A      - owner_id               = "816915057134" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags_all               = {} -> null%0A      - vpc_id                 = "vpc-08decc1a4b90eb685" -> null%0A    }%0A%0A  # aws_security_group.publicsg has been deleted%0A  - resource "aws_security_group" "publicsg" {%0A      - arn                    = "arn:aws:ec2:us-east-1:816915057134:security-group/sg-020bb710133f45b94" -> null%0A      - description            = "Allow HTTP and SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-020bb710133f45b94" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "HTTP from everywhere"%0A              - from_port        = 80%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 80%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "SSH from everywhere"%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_http_ssh_public" -> null%0A      - owner_id               = "816915057134" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags_all               = {} -> null%0A      - vpc_id                 = "vpc-08decc1a4b90eb685" -> null%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.ansibleinstance[0] will be created%0A  + resource "aws_instance" "ansibleinstance" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-02532d18e9b0f48dc"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-public-ansible-3"%0A          + "Owner" = "Group6Ansible"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-public-ansible-3"%0A          + "Owner" = "Group6Ansible"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.ansibleinstance[1] will be created%0A  + resource "aws_instance" "ansibleinstance" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-087cb0ddccfab17ba"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-public-ansible-4"%0A          + "Owner" = "Group6Ansible"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-public-ansible-4"%0A          + "Owner" = "Group6Ansible"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.bastion[0] will be created%0A  + resource "aws_instance" "bastion" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-046cf7fde39153aa4"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-public-bastion-2"%0A          + "Owner" = "Group6"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-public-bastion-2"%0A          + "Owner" = "Group6"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "30d31834dab0ad9d47aef7d7dd99e547c4879b41"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[0] will be created%0A  + resource "aws_instance" "privateinstance" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = false%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-0e041b06f241a8193"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-private-1"%0A          + "Owner" = "Group6"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-private-1"%0A          + "Owner" = "Group6"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = true%0A          + device_name           = (known after apply)%0A          + encrypted             = true%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[1] will be created%0A  + resource "aws_instance" "privateinstance" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = false%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "projectkey"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = "subnet-0b9f0e11e5c3bb38d"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-private-2"%0A          + "Owner" = "Group6"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Group6-prod-private-2"%0A          + "Owner" = "Group6"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_optio
  ```
  </details>
  *Pusher: @solipkimm, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*